#pragma once
#include <vector>

class convar;
using fn_change_callback_t = void( * )( convar* var, const char* old_value, float f_old_value );

template <class T>
void destruct(T* memory) {
	memory->~T();
}

template <typename T>
class utl_vector {
public:
	constexpr T& operator[]( int i ) { return memory[ i ]; };

	T& element(int i) {
		return memory[i];
	}

	void clear() {
		for (int i = size; --i >= 0;) {
			destruct(&element(i));
		}

		size = 0;
	}

	T* memory;
	int allocation_count;
	int grow_size;
	int size;
	T* elements;
};

enum cvar_flags {
	fcvar_none = 0,
	fcvar_unregistered = ( 1 << 0 ),
	fcvar_developmentonly = ( 1 << 1 ),
	fcvar_gamedll = ( 1 << 2 ),
	fcvar_clientdll = ( 1 << 3 ),
	fcvar_hidden = ( 1 << 4 ),
	fcvar_protected = ( 1 << 5 ),
	fcvar_sponly = ( 1 << 6 ),
	fcvar_archive = ( 1 << 7 ),
	fcvar_notify = ( 1 << 8 ),
	fcvar_userinfo = ( 1 << 9 ),
	fcvar_printableonly = ( 1 << 10 ),
	fcvar_unlogged = ( 1 << 11 ),
	fcvar_never_as_string = ( 1 << 12 ),
	fcvar_replicated = ( 1 << 13 ),
	fcvar_cheat = ( 1 << 14 ),
	fcvar_ss = ( 1 << 15 ),
	fcvar_demo = ( 1 << 16 ),
	fcvar_dontrecord = ( 1 << 17 ),
	fcvar_ss_added = ( 1 << 18 ),
	fcvar_release = ( 1 << 19 ),
	fcvar_reload_materials = ( 1 << 20 ),
	fcvar_reload_textures = ( 1 << 21 ),
	fcvar_not_connected = ( 1 << 22 ),
	fcvar_material_system_thread = ( 1 << 23 ),
	fcvar_archive_xbox = ( 1 << 24 ),
	fcvar_accessible_from_threads = ( 1 << 25 ),
	fcvar_server_can_execute = ( 1 << 28 ),
	fcvar_server_cannot_query = ( 1 << 29 ),
	fcvar_clientcmd_can_execute = ( 1 << 30 ),
	fcvar_meme_dll = ( 1 << 31 ),
	fcvar_material_thread_mask = ( fcvar_reload_materials | fcvar_reload_textures | fcvar_material_system_thread )
};

class convar {
public:
	/*
	const char* get_string() {
		using fn = const char*( __thiscall* )(convar*);
		return ( *( fn** ) this )[ 11 ]( this );
	}
	*/

	const char* get_string()
	{
		return string;
	}

	float get_float( ) {
		using fn = float( __thiscall* )( convar* );
		return ( *( fn** ) this )[ 12 ]( this );
	}

	int get_int( ) {
		using fn = int( __thiscall* )( convar* );
		return ( *( fn** ) this )[ 13 ]( this );
	}

	void set_value( const char* value ) {
		using fn = void( __thiscall* )( convar*, const char* );
		return ( *( fn** ) this )[ 14 ]( this, value );
	}
	void set_value( float value ) {
		using fn = void( __thiscall* )( convar*, float );
		return ( *( fn** ) this )[ 15 ]( this, value );
	}
	void set_value( int value ) {
		using fn = void( __thiscall* )( convar*, int );
		return ( *( fn** ) this )[ 16 ]( this, value );
	}
	void set_value( bool value ) {
		using fn = void( __thiscall* )( convar*, int );
		return ( *( fn** ) this )[ 16 ]( this, static_cast< int >( value ) );
	}

private:
	void* vtable; // 0x0000

public:
	convar* next;     // 0x0004
	__int32 registered; // 0x0008
	char* name;         // 0x000C
	char* help_str;     // 0x0010
	__int32 flags;      // 0x0014
	char pad[0x4];
	convar* parent;    // 0x001C
	char* default_value; // 0x0020
	char* string;        // 0x0024
	__int32 str_len;     // 0x0028
	float float_val;     // 0x002C
	__int32 int_val;     // 0x0030
	__int32 has_min;     // 0x0034
	float min;           // 0x0038
	__int32 has_max;     // 0x003C
	float max;           // 0x0040
	char pad_1[0x10];
	utl_vector<fn_change_callback_t> callbacks;
};