#pragma once
#include <windows.h>
#include <d3d9.h>
#include <cstdio>
#include "interfaces/ivcliententitylist.hpp"
#include "interfaces/cglobalvarsbase.hpp"
#include "interfaces/iplayermovement.hpp"
#include "interfaces/imaterialsystem.hpp"
#include "interfaces/ivengineclient.hpp"
#include "interfaces/ibaseclientdll.hpp"
#include "interfaces/ivmodelinfo.hpp"
#include "interfaces/isurface.hpp"
#include "interfaces/i_game_event_manager.hpp"
#include "interfaces/i_filesystem.hpp"
#include "interfaces/chudchat.hpp"
#include "interfaces/i_trace.hpp"
#include "interfaces/iv_render_beams.hpp"
#include "interfaces/panorama.hpp"
#include "interfaces/physics.hpp"
#include "interfaces/ilocalize.hpp"
#include "interfaces/iv_debug_overlay.hpp"
#include "interfaces/iconsole.hpp"
#include "interfaces/imdlcache.hpp"
#include "interfaces/iclientstate.hpp"
#include "interfaces/i_weapon_system.hpp"
#include "interfaces/iv_model_render.hpp"
#include "interfaces/iv_effects.hpp"
#include "interfaces/ipanel.hpp"
#include "interfaces/ienginesound.hpp"
#include "structs/usercmd.hpp"
#include "netvars/netvars.hpp"
#include "structs/weaponinfo.hpp"
#include "structs/color.hpp"
#include "math/vec3.hpp"
#include "math/vec2.hpp"
#include "classes/collideable.hpp"
#include "classes/animstate.hpp"
#include "math/math.hpp"
#include "interfaces/glow_manager.hpp"
#include "interfaces/i_input.hpp"
#include "interfaces/i_render_view.hpp"
#include "interfaces/i_steam_api.hpp"
#include "../utils/render/draw.hpp"
#include "../utils/vfunc.hpp"
#include "../utils/key_values.hpp"
#include "../utils/xor.hpp"
#include "../utils/utilities.hpp"

namespace interfaces {
	enum class interface_type { index, bruteforce };

	template <typename ret, interface_type type>
	ret* get_interface(const std::string& module_name, const std::string& interface_name) {
		using create_interface_fn = void* (*)(const char*, int*);
		const auto fn = reinterpret_cast<create_interface_fn>(GetProcAddress(GetModuleHandle(module_name.c_str()), "CreateInterface"));

		if (fn) {
			void* result = nullptr;

			switch (type) {
			case interface_type::index:
				result = fn(interface_name.c_str(), nullptr);

				break;
			case interface_type::bruteforce:
				char buf[128];

				for (uint32_t i = 0; i <= 100; ++i) {
					memset(static_cast<void*>(buf), 0, sizeof buf);

					result = fn(interface_name.c_str(), nullptr);

					if (result)
						break;
				}

				break;
			}

			if (!result)
				throw std::runtime_error(interface_name + " wasn't found in " + module_name);

			return static_cast<ret*>(result);
		}

		throw std::runtime_error(module_name + " wasn't found");
	}

	inline i_base_client_dll* client = nullptr;
	inline iv_client_entity_list* ent_list = nullptr;
	inline iv_engine_client* engine = nullptr;
	inline iv_model_info* model_info = nullptr;
	inline i_material_system* material_system = nullptr;
	inline i_client_mode* client_mode = nullptr;
	inline i_surface* surface = nullptr;
	inline i_localize* localize = nullptr;
	inline i_input_system* input_system = nullptr;
	inline c_global_vars_base* globals = nullptr;
	inline i_console* console = nullptr;
	inline i_mdl_cache* mdl_cache = nullptr;
	inline i_client_state* client_state = nullptr;
	inline i_panel* panel = nullptr;
	inline c_hud_chat* chat_element = nullptr;
	inline i_panoramaui_engine* panorama = nullptr;
	inline IMoveHelper* move_helper = nullptr;
	inline CGameMovement* game_movement = nullptr;
	inline i_weapon_system* weapon_system;
	inline IPrediction* prediction = nullptr;
	inline trace* trace_ray = nullptr;
	inline IDirect3DDevice9* device = nullptr;
	inline iv_debug_overlay* debug_overlay = nullptr;
	inline iv_model_render* model_render = nullptr;
	inline i_render_view* render_view = nullptr;
	inline i_game_event_manager2* event_manager = nullptr;
	inline i_physics_surface_props* surface_props = nullptr;
	inline IViewRenderBeams* render_beams = nullptr;
	inline glow_manager_t* glow_manager = nullptr;
	inline iv_effects* effects = nullptr;
	inline i_input* input = nullptr;
	inline c_physics_collision* physics_collision = nullptr;
	inline i_filesystem* filesystem;
	inline std::uint8_t* key_values_engine = nullptr;
	inline std::uint8_t* key_values_client = nullptr;

	inline i_steam_user* steam_user = nullptr;
	inline i_steam_friends* steam_friend = nullptr;
	inline i_steam_utils* steam_utils = nullptr;

	inline i_engine_sound* engine_sound = nullptr;
	inline void* key_values_system = nullptr;

	bool initialize();
}

enum data_update_type_t {
	data_update_created = 0,
	data_update_datatable_changed,
};

enum cs_weapon_type {
	WEAPONTYPE_KNIFE = 0,
	WEAPONTYPE_PISTOL,
	WEAPONTYPE_SUBMACHINEGUN,
	WEAPONTYPE_RIFLE,
	WEAPONTYPE_SHOTGUN,
	WEAPONTYPE_SNIPER_RIFLE,
	WEAPONTYPE_MACHINEGUN,
	WEAPONTYPE_C4,
	WEAPONTYPE_PLACEHOLDER,
	WEAPONTYPE_GRENADE,
	WEAPONTYPE_UNKNOWN
};

enum client_frame_stage_t {
	frame_undefined = -1,
	frame_start,
	// a network packet is being recieved
	frame_net_update_start,
	// data has been received and we are going to start calling postdataupdate
	frame_net_update_postdataupdate_start,
	// data has been received and called postdataupdate on all data recipients
	frame_net_update_postdataupdate_end,
	// received all packets, we can now do interpolation, prediction, etc
	frame_net_update_end,
	// start rendering the scene
	frame_render_start,
	// finished rendering the scene
	frame_render_end,
	frame_net_full_frame_update_on_remove
};

enum observer_modes {
	obs_mode_none = 0,
	obs_mode_deathcam,
	obs_mode_freezecam,
	obs_mode_fixed,
	obs_mode_in_eye,
	obs_mode_chase,
	obs_mode_roaming
};

enum move_type {
	movetype_none = 0,
	movetype_isometric,
	movetype_walk,
	movetype_step,
	movetype_fly,
	movetype_flygravity,
	movetype_vphysics,
	movetype_push,
	movetype_noclip,
	movetype_ladder,
	movetype_observer,
	movetype_custom,
	movetype_last = movetype_custom,
	movetype_max_bits = 4,
	max_movetype
};

enum e_effects {
	ef_bone_merge = 0x001,
	ef_bright_light = 0x002,
	ef_dimlight = 0x004,
	ef_no_interp = 0x008,
	ef_no_shadow = 0x010,
	ef_no_draw = 0x020,
	ef_no_receive_shadow = 0x040,
	ef_bone_merge_fastcull = 0x080,
	ef_item_blink = 0x100,
	ef_parent_animates = 0x200,
	ef_marked_for_fast_reflection = 0x400,
	ef_no_shadow_depth = 0x800,
	ef_shadow_depth_no_cache = 0x1000,
	ef_no_flash_light = 0x2000,
	ef_no_csm = 0x4000,
	ef_max_bits = 15
};

enum e_think_methods : int {
	think_fire_all_functions = 0,
	think_fire_base_only,
	think_fire_all_but_base,
};

enum entity_flags {
	fl_onground = (1 << 0),
	fl_ducking = (1 << 1),
	fl_waterjump = (1 << 2),
	fl_ontrain = (1 << 3),
	fl_inrain = (1 << 4),
	fl_frozen = (1 << 5),
	fl_atcontrols = (1 << 6),
	fl_client = (1 << 7),
	fl_fakeclient = (1 << 8),
	fl_inwater = (1 << 9),
	fl_fly = (1 << 10),
	fl_swim = (1 << 11),
	fl_conveyor = (1 << 12),
	fl_npc = (1 << 13),
	fl_godmode = (1 << 14),
	fl_notarget = (1 << 15),
	fl_aimtarget = (1 << 16),
	fl_partialground = (1 << 17),
	fl_staticprop = (1 << 18),
	fl_graphed = (1 << 19),
	fl_grenade = (1 << 20),
	fl_stepmovement = (1 << 21),
	fl_donttouch = (1 << 22),
	fl_basevelocity = (1 << 23),
	fl_worldbrush = (1 << 24),
	fl_object = (1 << 25),
	fl_killme = (1 << 26),
	fl_onfire = (1 << 27),
	fl_dissolving = (1 << 28),
	fl_transragdoll = (1 << 29),
	fl_unblockable_by_player = (1 << 30)
};

enum item_definition_indexes 
{
	WEAPON_INVALID = -1,
	ITEM_NONE = 0,
	WEAPON_DEAGLE,
	WEAPON_ELITE,
	WEAPON_FIVESEVEN,
	WEAPON_GLOCK,
	WEAPON_AK47 = 7,
	WEAPON_AUG,
	WEAPON_AWP,
	WEAPON_FAMAS,
	WEAPON_G3SG1,
	WEAPON_GALILAR = 13,
	WEAPON_M249,
	WEAPON_M4A1 = 16,
	WEAPON_MAC10,
	WEAPON_P90 = 19,
	WEAPON_MP5 = 23,
	WEAPON_UMP45,
	WEAPON_XM1014,
	WEAPON_BIZON,
	WEAPON_MAG7,
	WEAPON_NEGEV,
	WEAPON_SAWEDOFF,
	WEAPON_TEC9,
	WEAPON_TASER,
	WEAPON_HKP2000,
	WEAPON_MP7,
	WEAPON_MP9,
	WEAPON_NOVA,
	WEAPON_P250,
	WEAPON_SCAR20 = 38,
	WEAPON_SG556,
	WEAPON_SSG08,
	WEAPON_KNIFEGG,
	WEAPON_KNIFE,
	WEAPON_FLASHBANG,
	WEAPON_HEGRENADE,
	WEAPON_SMOKEGRENADE,
	WEAPON_MOLOTOV,
	WEAPON_DECOY,
	WEAPON_INCGRENADE,
	WEAPON_C4,
	WEAPON_HEALTHSHOT = 57,
	WEAPON_KNIFE_T = 59,
	WEAPON_M4A1_SILENCER,
	WEAPON_USP_SILENCER,
	WEAPON_CZ75A = 63,
	WEAPON_REVOLVER,
	WEAPON_TAGRENADE = 68,
	WEAPON_FISTS,
	WEAPON_BREACHCHARGE,
	WEAPON_TABLET = 72,
	WEAPON_MELEE = 74,
	WEAPON_AXE,
	WEAPON_HAMMER,
	WEAPON_SPANNER = 78,
	WEAPON_KNIFE_GHOST = 80,
	WEAPON_FIREBOMB,
	WEAPON_DIVERSION,
	WEAPON_FRAG_GRENADE,
	WEAPON_KNIFE_BAYONET = 500,
	WEAPON_KNIFE_CSS = 503,
	WEAPON_KNIFE_FLIP = 505,
	WEAPON_KNIFE_GUT,
	WEAPON_KNIFE_KARAMBIT,
	WEAPON_KNIFE_M9_BAYONET,
	WEAPON_KNIFE_TACTICAL,
	WEAPON_KNIFE_FALCHION = 512,
	WEAPON_KNIFE_SURVIVAL_BOWIE = 514,
	WEAPON_KNIFE_BUTTERFLY,
	WEAPON_KNIFE_PUSH,
	WEAPON_KNIFE_CORD = 517,
	WEAPON_KNIFE_CANIS = 518,
	WEAPON_KNIFE_URSUS = 519,
	WEAPON_KNIFE_GYPSY_JACKKNIFE = 520,
	WEAPON_KNIFE_NAVAJA,
	WEAPON_KNIFE_STILETTO = 522,
	WEAPON_KNIFE_WIDOWMAKER = 523,
	WEAPON_KNIFE_TALON,
	WEAPON_KNIFE_OUTDOOR = 521,
	WEAPON_KNIFE_SKELETON = 525,

	GLOVE_STUDDED_BLOODHOUND = 5027,
	GLOVE_T_SIDE = 5028,
	GLOVE_CT_SIDE = 5029,
	GLOVE_SPORTY = 5030,
	GLOVE_SLICK = 5031,
	GLOVE_LEATHER_WRAP = 5032,
	GLOVE_MOTORCYCLE = 5033,
	GLOVE_SPECIALIST = 5034,
	GLOVE_HYDRA,
	MAX_ITEMDEFINITIONINDEX
};

// How many bits to use to encode an edict.
#define MAX_EDICT_BITS 11 // # of bits needed to represent max edicts
// Max # of edicts in a level
#define MAX_EDICTS (1 << MAX_EDICT_BITS)

// types of precipitation
enum precipitation_type_t {
	PRECIPITATION_TYPE_RAIN = 0,
	PRECIPITATION_TYPE_SNOW,
	PRECIPITATION_TYPE_ASH,
	PRECIPITATION_TYPE_SNOWFALL,
	PRECIPITATION_TYPE_PARTICLERAIN,
	PRECIPITATION_TYPE_PARTICLEASH,
	PRECIPITATION_TYPE_PARTICLERAINSTORM,
	PRECIPITATION_TYPE_PARTICLESNOW,
	NUM_PRECIPITATION_TYPES
};

struct entity_handle_t {

	uintptr_t handle;

	constexpr entity_handle_t() : handle(0xFFFFFFFF) {
	}

	constexpr entity_handle_t(unsigned long handle) : handle(handle) {
	}

	class entity_t* get() const;

	bool operator==(const entity_handle_t& other) const;
	bool operator==(class entity_t* entity) const;
	bool operator!=(const entity_handle_t& other) const;
	bool operator!=(class entity_t* entity) const;
};

class AnimationLayer
{
public:
	bool m_bClientBlend;				 //0x0000
	float m_flBlendIn;					 //0x0004
	void* m_pStudioHdr;					 //0x0008
	int m_nDispatchSequence;     //0x000C
	int m_nDispatchSequence_2;   //0x0010
	uint32_t m_nOrder;           //0x0014
	uint32_t m_nSequence;        //0x0018
	float_t m_flPrevCycle;       //0x001C
	float_t m_flWeight;          //0x0020
	float_t m_flWeightDeltaRate; //0x0024
	float_t m_flPlaybackRate;    //0x0028
	float_t m_flCycle;           //0x002C
	void* m_pOwner;              //0x0030 // player's thisptr
	char pad_0038[4];            //0x0034
};

struct renderable_info_t {
	entity_t* renderable;
	std::byte pad[18];
	uint16_t flags;
	uint16_t flags2;
};

class entity_t {
public:

	void* animating() {
		return reinterpret_cast<void*>(uintptr_t(this) + 0x4);
	}

	collideable_t* collideable() {
		using original_fn = collideable_t * (__thiscall*)(void*);
		return (*(original_fn**)this)[3](this);
	}

	const matrix_t& coordinate_frame() {
		static auto coord_frame = netvar_manager::get_net_var(fnv::hash("DT_BaseEntity"), fnv::hash("m_CollisionGroup")) - 0x30;
		return *(matrix_t*)((uintptr_t)this + coord_frame);
	}

	void* networkable() {
		return reinterpret_cast<void*>(uintptr_t(this) + 0x8);
	}

	bool is_player() {
		using original_fn = bool(__thiscall*)(entity_t*);
		return (*(original_fn**)this)[158](this);
	}

	bool is_weapon() {
		using original_fn = bool(__thiscall*)(entity_t*);
		return (*(original_fn**)this)[166](this);
	}

	bool in_buyzone() {
